tugas 9/benchmark_thread/test_result_10.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            46000

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      10
Time taken for tests:   471.406 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    2.12 [#/sec] (mean)
Time per request:       4714.063 [ms] (mean)
Time per request:       471.406 [ms] (mean, across all concurrent requests)
Transfer rate:          0.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     2 4603 6382.4   1778   36509
Waiting:        1 4495 6239.9   1696   36333
Total:          4 4603 6382.4   1778   36509

Percentage of the requests served within a certain time (ms)
  50%   1778
  66%   3597
  75%   5359
  80%   7906
  90%  13858
  95%  19473
  98%  24620
  99%  28590
 100%  36509 (longest request)