tugas 9/benchmark_thread/test_result_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            46000

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      100
Time taken for tests:   461.906 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    2.16 [#/sec] (mean)
Time per request:       46190.569 [ms] (mean)
Time per request:       461.906 [ms] (mean, across all concurrent requests)
Transfer rate:          0.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   4.2      0      22
Processing:     7 35294 45312.8  15075  205420
Waiting:        6 35166 45116.9  15030  199993
Total:         25 35295 45311.7  15075  205420

Percentage of the requests served within a certain time (ms)
  50%  15075
  66%  30176
  75%  46618
  80%  61425
  90%  102269
  95%  148091
  98%  181016
  99%  190603
 100%  205420 (longest request)