tugas 9/benchmark_thread/test_result_500.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            46000

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      500
Time taken for tests:   1.307 seconds
Complete requests:      1000
Failed requests:        145
   (Connect: 0, Receive: 0, Length: 145, Exceptions: 0)
Non-2xx responses:      145
Total transferred:      17690 bytes
HTML transferred:       580 bytes
Requests per second:    765.25 [#/sec] (mean)
Time per request:       653.378 [ms] (mean)
Time per request:       1.307 [ms] (mean, across all concurrent requests)
Transfer rate:          13.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   67  34.9     67     132
Processing:    10   76 120.9     52    1168
Waiting:        0   35 124.5      0    1164
Total:         29  143 134.1    115    1273

Percentage of the requests served within a certain time (ms)
  50%    115
  66%    120
  75%    124
  80%    125
  90%    255
  95%    359
  98%    509
  99%    956
 100%   1273 (longest request)